尽 取 外言 '如:竞赛'.

算 表示 数值 为 数:
    若 数值 == 0 则
        得 '0'.
    然
    幂值 取 1.
    指数 取 0.
    循
        若 幂值*2 > 数值 则 破. 然
        幂值 取 幂值*2.
        指数 取 指数+1.
    环
    余值 取 数值.
    答案 取 ''.
    循
        若 指数 < 0 则 破. 然
        若 余值 >= 幂值 则
            若 答案 != '' 则
                答案 取 答案+'+'.
            然
            若 指数 == 0 则
                答案 取 答案+'2(0)'.
            另
                若 指数 == 1 则
                    答案 取 答案+'2'.
                另
                    答案 取 答案+'2('+(表示 指数)+')'.
                然
            然
            余值 取 余值-幂值.
        然
        幂值 取 幂值/2.
        指数 取 指数-1.
    环
    得 答案.
法

入 取 读入.
原数 取 入 其 数.
出 取 蓄出.
出 其 行 (表示 原数).
出 其 清.
